Revit 2026 API

# RasterQualityType Enumeration

---

An enumerated type listing the options for raster quality.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public enum RasterQualityType
```
```vb
Public Enumeration RasterQualityType
```
```cpp
public enum class RasterQualityType
```
```fsharp
type RasterQualityType
```

| Member name | Value | Description |
| --- | --- | --- |
| High | 300 | The type of Raster Quality is High. |
| Low | 72 | The type of Raster Quality is Low. |
| Medium | 150 | The type of Raster Quality is Medium. |
| Presentation | 600 | The type of Raster Quality is Presentation. |

#### Reference

Autodesk.Revit.DB Namespace